In [1]:
from __future__ import print_function
print("hello world")

hello world

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import os

In [3]:
data = pd.read_csv("A1_mosquito_data.csv")

In [4]:
print(data)

   year  temperature  rainfall  mosquitos
0  2001           80       157        150
1  2002           85       252        217
2  2003           86       154        153
3  2004           87       159        158
4  2005           74       292        243
5  2006           75       283        237
6  2007           80       214        190
7  2008           85       197        181
8  2009           74       231        200
9  2010           74       207        184

In [5]:
data.head()

   year  temperature  rainfall  mosquitos
0  2001           80       157        150
1  2002           85       252        217
2  2003           86       154        153
3  2004           87       159        158
4  2005           74       292        243

In [6]:
data.tail()

   year  temperature  rainfall  mosquitos
5  2006           75       283        237
6  2007           80       214        190
7  2008           85       197        181
8  2009           74       231        200
9  2010           74       207        184

In [7]:
data.sample()

   year  temperature  rainfall  mosquitos
0  2001           80       157        150

In [8]:
data.describe()

             year  temperature    rainfall  mosquitos
count    10.00000    10.000000   10.000000   10.00000
mean   2005.50000    80.000000  214.600000  191.30000
std       3.02765     5.456902   50.317216   33.23335
min    2001.00000    74.000000  154.000000  150.00000
25%    2003.25000    74.250000  168.500000  163.75000
50%    2005.50000    80.000000  210.500000  187.00000
75%    2007.75000    85.000000  246.750000  212.75000
max    2010.00000    87.000000  292.000000  243.00000

In [9]:
data['year']

0    2001
1    2002
2    2003
3    2004
4    2005
5    2006
6    2007
7    2008
8    2009
9    2010
Name: year, dtype: int64

In [10]:
data[['year','mosquitos']]

   year  mosquitos
0  2001        150
1  2002        217
2  2003        153
3  2004        158
4  2005        243
5  2006        237
6  2007        190
7  2008        181
8  2009        200
9  2010        184

In [11]:
data[0:2]

   year  temperature  rainfall  mosquitos
0  2001           80       157        150
1  2002           85       252        217

In [12]:
data[1:2]

   year  temperature  rainfall  mosquitos
1  2002           85       252        217

In [13]:
data.iloc[1]

year           2002
temperature      85
rainfall        252
mosquitos       217
Name: 1, dtype: int64

In [14]:
data.iloc[1:3]

   year  temperature  rainfall  mosquitos
1  2002           85       252        217
2  2003           86       154        153

In [21]:
data['temperature'][0]

80

In [16]:
data['temperature'][data['temperature'] > 75]

0    80
1    85
2    86
3    87
6    80
7    85
Name: temperature, dtype: int64

In [17]:
data['temperature'][data['year'] > 2005]

5    75
6    80
7    85
8    74
9    74
Name: temperature, dtype: int64

In [18]:
data.mean()

year           2005.5
temperature      80.0
rainfall        214.6
mosquitos       191.3
dtype: float64

In [20]:
data.mean(1)

0    597.00
1    639.00
2    599.00
3    602.00
4    653.50
5    650.25
6    622.75
7    617.75
8    628.50
9    618.75
dtype: float64

In [22]:
data.max()

year           2010
temperature      87
rainfall        292
mosquitos       243
dtype: int64

In [23]:
data.idxmin()

year           0
temperature    4
rainfall       2
mosquitos      0
dtype: int64

In [24]:
data['temperature'].min()

74

In [40]:
# loops and ifs in python pandas
for index, row in data.iterrows():
    temp_in_f = row['temperature']
    print("temperature in row %s is %s Fahrenheit" %(index, temp_in_f))
    temp_in_c = (temp_in_f - 32) * 5 / 9.0
    print("temperature in row %s is %s Celsius" %(index, temp_in_c))
    
    if temp_in_c > 23:
        print("Hotter than 23C!")

temperature in row 0 is 80 Fahrenheit
temperature in row 0 is 26.666666666666668 Celsius
Hotter than 23C!
temperature in row 1 is 85 Fahrenheit
temperature in row 1 is 29.444444444444443 Celsius
Hotter than 23C!
temperature in row 2 is 86 Fahrenheit
temperature in row 2 is 30.0 Celsius
Hotter than 23C!
temperature in row 3 is 87 Fahrenheit
temperature in row 3 is 30.555555555555557 Celsius
Hotter than 23C!
temperature in row 4 is 74 Fahrenheit
temperature in row 4 is 23.333333333333332 Celsius
Hotter than 23C!
temperature in row 5 is 75 Fahrenheit
temperature in row 5 is 23.88888888888889 Celsius
Hotter than 23C!
temperature in row 6 is 80 Fahrenheit
temperature in row 6 is 26.666666666666668 Celsius
Hotter than 23C!
temperature in row 7 is 85 Fahrenheit
temperature in row 7 is 29.444444444444443 Celsius
Hotter than 23C!
temperature in row 8 is 74 Fahrenheit
temperature in row 8 is 23.333333333333332 Celsius
Hotter than 23C!
temperature in row 9 is 74 Fahrenheit
temperature in row 9 is 23.333333333333332 Celsius
Hotter than 23C!